app/Controllers/Produk.php

    public function index($alert=''){
        $etc = new Etc;
        $data_alert = $etc->alert_msg($alert);
        $data['data_alert'] = $data_alert;

        $this->ProdukModel->orderBy('last_update_produk','desc');
    	$qr_produk = $this->ProdukModel->get();
---
SELECT *
FROM `produk`
ORDER BY `last_update_produk` DESC

    public function upload_pic($kode=''){
        $this->ProdukModel->where(['id_produk'=>$kode]);
        $data['id'] = $kode;
        $data['qr_produk'] = $this->ProdukModel->get()->getResult();
---
SELECT *
FROM `produk`
WHERE `id_produk` = 'PR006'

    public function proses_upload_pic($kode = ''){
        $validationRule = [
            'uploadpic' => [
                'label' => 'Image File',
                'rules' => [
                    'uploaded[uploadpic]',
                    'is_image[uploadpic]',
                    'mime_in[uploadpic,image/jpg,image/jpeg,image/gif,image/png,image/webp]',
                    'max_dims[uploadpic,1024,768]'
                ],
            ],
        ];
        if (! $this->validateData([], $validationRule)) {
            $data = ['errors' => $this->validator->getErrors()];
            dd($data);
        }

        $img = $this->request->getFile('uploadpic');

        if (! $img->hasMoved()) {
            $nImg = explode('.', $img->getName());
            $new_name = 'img_'.$kode.'.'.$nImg[1];
            $filepath = $img->move(ROOTPATH.'/public/images/',$new_name,true);
            $data = ['gambar_produk'=>$new_name];
            $this->ProdukModel->set($data);
            $this->ProdukModel->where(['id_produk'=>$kode]);
            $this->ProdukModel->update();
---
UPDATE `produk` SET `gambar_produk` = 'img_PR006.jpeg'
WHERE `id_produk` = 'PR006'

    public function delete_pic($kode=''){
        $this->ProdukModel->where(['id_produk'=>$kode]);
        $qr = $this->ProdukModel->get()->getResult();
        foreach($qr as $row){
            $gambar = $row->gambar_produk;
        }
        @unlink(ROOTPATH.'/public/images/'.$gambar);

        $this->ProdukModel->where(['id_produk'=>$kode]);
        $this->ProdukModel->set(['gambar_produk'=>'']);
        $this->ProdukModel->update();
---
SELECT *
FROM `produk`
WHERE `id_produk` = 'PR006'
UPDATE `produk` SET `gambar_produk` = ''
WHERE `id_produk` = 'PR006'