app/Controllers/Transaksi.php

SELECT *
FROM `transaksi_header`
ORDER BY `trans_date` ASC
SELECT *
FROM `transaksi_header`
RIGHT JOIN `pelanggan` ON `transaksi_header`.`id_pelanggan` = `pelanggan`.`id_pelanggan`
ORDER BY `trans_date` ASC
---
    public function index($alert=''){
        $this->TransHeaderModel->join('pelanggan','transaksi_header.id_pelanggan = pelanggan.id_pelanggan');
        $this->TransHeaderModel->orderBy('trans_date','asc');
        $qr_header = $this->TransHeaderModel->get();

SELECT *
FROM `transaksi_header`
JOIN `transaksi_detail` ON `transaksi_detail`.`id_theader` = `transaksi_header`.`id_theader`
WHERE `transaksi_header`.`id_theader` = 'TR001'
SELECT *
FROM `transaksi_header`
JOIN `transaksi_detail` ON `transaksi_detail`.`id_theader` = `transaksi_header`.`id_theader`
JOIN `pelanggan` ON `transaksi_header`.`id_pelanggan` = `pelanggan`.`id_pelanggan`
WHERE `transaksi_header`.`id_theader` = 'TR001'
SELECT *
FROM `produk`
---
    public function detail($kode=''){
        $this->TransHeaderModel->join('transaksi_detail','transaksi_detail.id_theader = transaksi_header.id_theader');
        $this->TransHeaderModel->join('pelanggan','transaksi_header.id_pelanggan = pelanggan.id_pelanggan');
        $this->TransHeaderModel->where(['transaksi_header.id_theader'=>$kode]);
        $qr = $this->TransHeaderModel->get();
        $data['qr'] = $qr->getResult();
        $data['produk'] = $this->ProdukModel->get()->getResult();